---
kind: property
id: P:Autodesk.Revit.DB.Events.FileImportedEventArgs.Format
source: html/d9ce87ec-3422-cd61-101c-1d7f4568f821.htm
---
# Autodesk.Revit.DB.Events.FileImportedEventArgs.Format Property

Identifies the import format, e.g. DWG or image.

## Syntax (C#)
```csharp
public ImportExportFileFormat Format { get; }
```